<?php

return [
    'unique' => 'ข้อมูลนี้ถูกใช้งานแล้ว กรุณาใช้ข้อมูลอื่น',
    'required' => 'กรุณากรอกข้อมูลในช่องนี้',
    'email' => 'รูปแบบอีเมลไม่ถูกต้อง',
    'confirmed' => 'รหัสผ่านและการยืนยันรหัสผ่านไม่ตรงกัน',

    'custom' => [
        'email' => [
            'unique' => 'อีเมลนี้ถูกใช้งานแล้ว กรุณาใช้อีเมลอื่น',
            'required' => 'กรุณากรอกอีเมล',
            'email' => 'รูปแบบอีเมลไม่ถูกต้อง',
        ],
        'name' => [
            'required' => 'กรุณากรอกชื่อของคุณ',
        ],
        'password' => [
            'required' => 'กรุณากรอกรหัสผ่าน',
            'confirmed' => 'รหัสผ่านและการยืนยันรหัสผ่านไม่ตรงกัน',
        ],
    ],
];
